fio/log/2018-07-09_10:51:41_1G/fio_randwrite_08k.log
rbd_image0: (g=0): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=rbd, iodepth=64
...
fio-3.1
Starting 5 processes

rbd_image0: (groupid=0, jobs=5): err= 0: pid=206185: Mon Jul  9 11:24:19 2018
  write: IOPS=1124, BW=8996KiB/s (9212kB/s)(5120MiB/582792msec)
    slat (nsec): min=1584, max=451392, avg=5779.21, stdev=4327.11
    clat (usec): min=982, max=3153.0k, avg=269846.95, stdev=330006.84
     lat (usec): min=990, max=3153.0k, avg=269852.73, stdev=330006.90
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    5], 10.00th=[   36], 20.00th=[   71],
     | 30.00th=[   99], 40.00th=[  125], 50.00th=[  155], 60.00th=[  192],
     | 70.00th=[  253], 80.00th=[  380], 90.00th=[  659], 95.00th=[ 1020],
     | 99.00th=[ 1636], 99.50th=[ 1821], 99.90th=[ 2198], 99.95th=[ 2333],
     | 99.99th=[ 2635]
   bw (  KiB/s): min=   32, max=58409, per=26.75%, avg=2406.68, stdev=2248.96, samples=4233
   iops        : min=    4, max= 7301, avg=300.76, stdev=281.10, samples=4233
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.15%, 4=4.02%, 10=2.26%, 20=0.70%, 50=6.53%
  lat (msec)   : 100=17.19%, 250=38.79%, 500=15.87%, 750=6.26%, 1000=2.96%
  lat (msec)   : 2000=5.06%, >=2000=0.21%
  cpu          : usr=0.14%, sys=0.03%, ctx=26832, majf=0, minf=38810
  IO depths    : 1=0.7%, 2=1.9%, 4=5.2%, 8=12.0%, 16=25.0%, 32=52.7%, >=64=2.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=98.3%, 8=0.2%, 16=0.1%, 32=0.1%, 64=1.5%, >=64=0.0%
     issued rwt: total=0,655360,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=8996KiB/s (9212kB/s), 8996KiB/s-8996KiB/s (9212kB/s-9212kB/s), io=5120MiB (5369MB), run=582792-582792msec

Disk stats (read/write):
    dm-0: ios=0/1804, merge=0/0, ticks=0/12371, in_queue=12371, util=2.00%, aggrios=0/2373, aggrmerge=0/34, aggrticks=0/12366, aggrin_queue=12365, aggrutil=2.00%
  sdc: ios=0/2373, merge=0/34, ticks=0/12366, in_queue=12365, util=2.00%